In [1]:
'''

Inspiration
The idea is to see if we can use this dataset to

1) Visualize the water need / usage of the city
2) Identify whether the water sources availability will be able to meet the needs till the subsequent monsoon?
3) How bad is the current water crisis compared to previous years?

'''

'\n\nInspiration\nThe idea is to see if we can use this dataset to\n\n1) Visualize the water need / usage of the city\n2) Identify whether the water sources availability will be able to meet the needs till the subsequent monsoon?\n3) How bad is the current water crisis compared to previous years?\n\n'

In [2]:
reservoir_csv = "..\\..\\..\\Data\\GW\\chennai-water-management\\chennai_reservoir_levels.csv"
rainfall_csv = "..\\..\\..\\Data\\GW\\chennai-water-management\\chennai_reservoir_rainfall.csv"

import pandas as pd
#from pandas import DataFrame as df

reservoir_df = pd.read_csv(reservoir_csv)
rainfall_df =  pd.read_csv(rainfall_csv)
reservoir_df.head()

         Date  POONDI  CHOLAVARAM  REDHILLS  CHEMBARAMBAKKAM
0  01-01-2004     3.9         0.0     268.0              0.0
1  02-01-2004     3.9         0.0     268.0              0.0
2  03-01-2004     3.9         0.0     267.0              0.0
3  04-01-2004     3.9         0.0     267.0              0.0
4  05-01-2004     3.8         0.0     267.0              0.0

In [3]:
rainfall_df.head()

         Date  POONDI  CHOLAVARAM  REDHILLS  CHEMBARAMBAKKAM
0  01-01-2004     0.0         0.0       0.0              0.0
1  02-01-2004     0.0         0.0       0.0              0.0
2  03-01-2004     0.0         0.0       0.0              0.0
3  04-01-2004     0.0         0.0       0.0              0.0
4  05-01-2004     0.0         0.0       0.0              0.0